/* ----
 * ---- file   : pattern.h
 * ---- author : bsp, void, alisomay (joint rev.eng efforts)
 * ---- legal  : Distributed under terms of the MIT LICENSE (MIT).
 * ----
 * ---- Permission is hereby granted, free of charge, to any person obtaining a copy
 * ---- of this software and associated documentation files (the "Software"), to deal
 * ---- in the Software without restriction, including without limitation the rights
 * ---- to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
 * ---- copies of the Software, and to permit persons to whom the Software is
 * ---- furnished to do so, subject to the following conditions:
 * ----
 * ---- The above copyright notice and this permission notice shall be included in
 * ---- all copies or substantial portions of the Software.
 * ----
 * ---- THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * ---- IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * ---- FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
 * ---- AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * ---- LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
 * ---- OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN
 * ---- THE SOFTWARE.
 * ----
 * ---- info   : This is part of the "libanalogrytm" package.
 * ----
 * ---- created: 30Jul2014

#define AR_TRIG_CONDITION_1ST          28u
#define AR_TRIG_CONDITION_1ST_NOT      29u
#define AR_TRIG_CONDITION_1B2          30u
#define AR_TRIG_CONDITION_2B2          31u
#define AR_TRIG_CONDITION_1B3          32u
#define AR_TRIG_CONDITION_2B3          33u
#define AR_TRIG_CONDITION_3B3          34u
#define AR_TRIG_CONDITION_1B4          35u
#define AR_TRIG_CONDITION_2B4          36u
#define AR_TRIG_CONDITION_3B4          37u
#define AR_TRIG_CONDITION_4B4          38u
#define AR_TRIG_CONDITION_1B5          39u
#define AR_TRIG_CONDITION_2B5          40u
#define AR_TRIG_CONDITION_3B5          41u
#define AR_TRIG_CONDITION_4B5          42u
#define AR_TRIG_CONDITION_5B5          43u
#define AR_TRIG_CONDITION_1B6          44u
#define AR_TRIG_CONDITION_2B6          45u
#define AR_TRIG_CONDITION_3B6          46u
#define AR_TRIG_CONDITION_4B6          47u
#define AR_TRIG_CONDITION_5B6          48u
#define AR_TRIG_CONDITION_6B6          49u
#define AR_TRIG_CONDITION_1B7          50u
#define AR_TRIG_CONDITION_2B7          51u
#define AR_TRIG_CONDITION_3B7          52u
#define AR_TRIG_CONDITION_4B7          53u
#define AR_TRIG_CONDITION_5B7          54u
#define AR_TRIG_CONDITION_6B7          55u
#define AR_TRIG_CONDITION_7B7          56u
#define AR_TRIG_CONDITION_1B8          57u
#define AR_TRIG_CONDITION_2B8          58u
#define AR_TRIG_CONDITION_3B8          59u
#define AR_TRIG_CONDITION_4B8          60u
#define AR_TRIG_CONDITION_5B8          61u
#define AR_TRIG_CONDITION_6B8          62u
#define AR_TRIG_CONDITION_7B8          63u
#define AR_TRIG_CONDITION_8B8          64u
#define AR_TRIG_CONDITION_NONE        127u


/*
 *
 ** Track trigger types  (see ar_pattern_track_t.trigs)
 *
 */
#define AR_TRIG_ENABLE     0x0001u  /* bit  0:        enable trig [TRIG]       */
#define AR_TRIG_RETRIG     0x0002u  /* bit  1: <ali>  retrig    [FUNC+Retrig+] */
#define AR_TRIG_MUTE       0x0004u  /* bit  2: <void> mute      [FUNC+A/E]     */
#define AR_TRIG_ACCENT     0x0008u  /* bit  3: <void> accent    [FUNC+B/F]     */
#define AR_TRIG_SWING      0x0010u  /* bit  4: <void> swing     [FUNC+C/G]     */
#define AR_TRIG_SLIDE      0x0020u  /* bit  5: <void> slide     [FUNC+D/H]     */
#define AR_TRIG_LFO_PL_EN  0x0040u  /* bit  6:        enable LFO p-lock        */
#define AR_TRIG_SYN_PL_SW  0x0080u  /* bit  7:        p-locked SYN state       */
#define AR_TRIG_SMP_PL_SW  0x0100u  /* bit  8:        p-locked SMP state       */
#define AR_TRIG_ENV_PL_SW  0x0200u  /* bit  9:        p-locked ENV state       */
#define AR_TRIG_LFO_PL_SW  0x0400u  /* bit 10:        p-locked LFO state       */
#define AR_TRIG_SYN_PL_EN  0x0800u  /* bit 11:        enable SYN p-lock        */
#define AR_TRIG_SMP_PL_EN  0x1000u  /* bit 12:        enable SMP p-lock        */
#define AR_TRIG_ENV_PL_EN  0x2000u  /* bit 13:        enable ENV p-lock        */



/*
 *
 ** Track structure
 *
 *      0x281(641) bytes (v5/FW1.70)
 *      0x289(649) bytes (v4/FW1.50..1.61b)
 *      0x288(648) bytes (v1)
 *
 */
typedef struct {
   sU8     trig_bits[((14*64)/8)];      /* @0x0004..0x0073   See AR_TRIG_xxx flags. 14 bits per step ((14*64)/8)==112 bytes */
   sU8     notes[64];                   /* @0x0074..0x00B3   127=unset (default note), MIDI note (0..126) otherwise (lower 7 bits)
                                         *                   bit7: 1=no trig condition, 0=have trig condition
                                         *                          ==> 0x7F = default note with trig cond
                                         *                          ==> 0xFF = default note without trig cond
                                         */
   sU8     velocities[64];              /* @0x00B4..0x00F3    0xFF=unset, 0x00=0, 0x7F=127             */
   sU8     note_lengths[64];            /* @0x00F4..0x0133    0xFF=unset, 0=0.125 (1/128), 1=0.1875,
                                                              2=1/64 (0.25), 3=0.3125, 4=0.375, 5=0.4375,
                                                              6=1/32, 7=0.5625, 8=0.625, 9=0.6875, .., 13=0.9375,
                                                              14=1/16, 15=1.0625, 16=1.25, .., 29=1.9375,
                                                              30=1/8, 31=2.125, 32=2.25, .., 38=3, 39=3.125, .., 45=3.875
                                                              46=1/4 47=4.25, .., 61=7.75
                                                              62=1/2, 63=8.5, .., 77=15.5,
                                                              78=16 (1/1), 79=17, .., 93=31,
                                                              94=32 (2/1), 95=34, .., 109=62,
                                                              110=64 (4/1), 111=68, .., 121=108, 122=112, 123=116, 124=120, 125=124,
                                                              126=128 (8/1),
                                                              127=inf
                                        */
   sU8     micro_timings[64];           /* @0x0134..0x0173    Micro timing   (lower 6 bits, -23..+23) */
   sU8     retrig_lengths[64];          /* ?@0x0174..0x01B3   Retrig lengths (lower 7 bits, 0..126(=128), 127=inf)   */
   sU8     retrig_rates[64];            /* ?@0x01B4..0x01F3   Retrig rates   (lower 5 bits, 0(=1/1)..16(=1/80))
                                         *                    Changing the trig condition of step 1 updates 0x1c4
                                         */
   sS8     retrig_velocity_offsets[64]; /* ?@0x01F4..0x0233   Retrig velocity offsets (-128..+127)   */
   sU8     default_note;                /* @0x0234            <void> trigNote                        */
   sU8     default_velocity;            /* @0x0235            <void> trigVelocity                    */
   sU8     default_note_length;         /* @0x0236            <void> trigLength                      */
   s_u16_t default_trig_flags;          /* @0x0237            ENV/LFO(hi) + SYN/SMP(lo) trigFlags    */
   sU8     num_steps;                   /* @0x0239            number of steps (1..64) / track length */
   sU8     quantize_amount;             /* @0x023A            quantize amount                        */
   sU8     sound_locks[64];             /* ?@0x023B..0x027A   soundLocks                             */
   sU8     flags_and_speed;             /* @0x027B.           bit7=send MIDI. bit2..0: speed, 0=2x, 1=3/2x, 2=1x, 3=3/4x, 4=1/2x, 5=1/4x, 6=1/8x (see AR_SPEED_xxx) */
   sU8     trig_probability;            /* @0x027C            <ali> Trig probability 0..100                                                   */
   sU8     euc_mode;                    /* @0x027D            <ali> Euclidean mode 0=off, 128=on                                              */
   sU8     euc_pl1;                     /* @0x027E            <ali> Euclidean PL1 / Pulse generator 1  0..64 (number of pulses)               */
   sU8     euc_pl2;                     /* @0x027F            <ali> Euclidean PL2 / Pulse generator 2  0..64 (number of pulses)               */
   sU8     euc_ro1;                     /* @0x0280            <ali> Euclidean RO1 / Rotation generator 1  0..126 (middle point 63)            */
   sU8     euc_ro2;                     /* @0x0281            <ali> Euclidean RO2 / Rotation generator 2  0..126 (middle point 63)            */
   sU8     euc_tro;                     /* @0x0282            <ali> Euclidean TRO / Track rotation 0..126 (middle point 63)                   */
   sU8     pad_scale;                   /* @0x0283            <ali> PAD SCALE 255 chromatic 0..34 All modes. See AR_PADSCALE_xxx              */
   sU8     root_note;                   /* @0x0284            <ali> bits 0..3: Root Note 0..11 (C..B) bits 4..7: pad row offset (0..9, def=6) */

} ar_pattern_track_t;


/*
 *
 ** P-Lock sequence structure
 *
 *     0x42 bytes
 *
 */
typedef struct {
   sU8 plock_type;  /* @0x2091          0xFF=unused seq. See AR_PLOCK_TYPE_xxx               */
   sU8 track_nr;    /* @0x2092          0xFF=unused seq. Tracknr (0..12)                     */
   sU8 data[64];    /* @0x2093..0x20D2  Plock data (64 steps, value range is type dependent) */
} ar_plock_seq_t;


/*
 *
 ** Pattern structure
 *
 *    0x332D(13101) bytes (v5/FW1.70)
 *    0x3395(13205) bytes (v4/FW1.50..1.61b)
 *    0x3386(13190) bytes (v1)
 *
 */
typedef struct {
   sU8                magic[4];              /* version? (00 00 00 01=FW1.0, 00 00 00 03=FW1.50, 00 00 00 05=FW1.70)    */
   ar_pattern_track_t tracks[13];            /* @0x0004..0x2090  13*641=8333 bytes                                      */
   ar_plock_seq_t     plock_seqs[72];        /* @0x2091..0x3320  16#42*72=4752 bytes                                    */
   s_u16_t            master_length;         /* @0x3321            Master length (in adv mode). 1=inf                   */
   sU8                master_chg_msb;        /* @0x3323            masterChange MSB                                     */
   sU8                master_chg_lsb;        /* @0x3324            masterChange LSB (1=OFF, 2=2, 3=3, ..,  )            */
   sU8                kit_number;            /* @0x3325            0..127. 0xFF when kit is not saved.                  */
   sU8                swing_amount;          /* @0x3226            swingAmount (0..30 => 50%..80%)                      */
   sU8                time_mode;             /* @0x3327            timeMode (0=normal, 1=advanced)                      */
   sU8                master_speed;          /* @0x3228            See AR_SPEED_xxx.                                    */
   sU8                global_quantize;       /* @0x3229                                                                 */
   sU8                bpm_msb;               /* @0x332A            multiplied by 120. (used when BPM mode=PTN)          */
   sU8                bpm_lsb;               /* @0x332B                                                                 */
   sU8                pad_scale_per_pattern; /* @0x332C            1=apply to all tracks, 0=apply only to current track */
} ar_pattern_t;


/*
 * Create pattern sysex request.
 *
 *  Arguments:
 *     _dstbuf - Destination buffer. Must be large enough to hold the request string (15 bytes, see AR_SYSEX_REQUEST_MSG_SZ).
 *      _devId - Sysex device id (0..15).
 *  _patternNr - Determine pattern number. 0=A01, 1=A02, .. 16=B01, ..127=H15.
 *
 *  Returns:
 *   AR_ERR_OK if the request was created successfully.
 *
 */
S_EXTERN ar_error_t ar_pattern_request (sU8 *_dstBuf, sU8 _devId, sU8 _patternNr);


/*
 * Create pattern workbuffer sysex request.
 *
 *  Arguments:
 *     _dstbuf - Destination buffer. Must be large enough to hold the request string (15 bytes, see AR_SYSEX_REQUEST_MSG_SZ).
 *      _devId - Sysex device id (0..15).
 *
 *  Returns:
 *   AR_ERR_OK if the request was created successfully.
 *
 */
